COLOR_DICTIONARY = {
    "белый": [
        "белый", "белоснежный", "молочно-белый", "слоновая кость", "айвори", "white", 
        "off-white", "ivory", "snow white"],

    "чёрный": [
        "чёрный", "угольно-чёрный", "графитово-чёрный", "black", "jet black", "charcoal black"],

    "серый": [
        "серый", "светло-серый", "тёмно-серый", "графитовый", "мышиный", "дымчатый", "пепельный", 
        "стальной", "серо-голубой", "серо-зелёный", "grey", "gray", "light grey", "light gray", "dark grey", 
        "dark gray", "charcoal", "slate grey", "ash grey", "серебристый", "серебряный", "серебро", 
        "silver", "silver-colored", "silver coloured"],
    "бежевый": [
        "бежевый", "светло-бежевый", "тёмно-бежевый", "песочный", "кремовый", "экрю", "beige", "cream", 
        "sand", "sandy", "ecru"],

    "коричневый": [
        "коричневый", "светло-коричневый", "тёмно-коричневый", "шоколадный", "кофейный", "каштановый", 
        "ореховый", "умбра", "brown", "light brown", "dark brown", "chocolate", "coffee", "chestnut", "walnut brown", 
        "wood color", "wood colour", "wood tone", "wood-look", "под дерево", "цвет дерева", "бронзовый", "бронза", 
        "bronze", "bronze-colored", "bronze coloured"],

    "красный": [
        "красный", "светло-красный", "тёмно-красный", "ярко-красный", "алый", "рубиновый", "карминовый", 
        "бордовый", "бордо", "вишнёвый", "терракотовый", "винный", "марсала", "бургунди", "red", "scarlet", 
        "crimson", "ruby red", "burgundy", "wine red", "maroon"],

    "оранжевый": [
        "оранжевый", "светло-оранжевый", "тёмно-оранжевый", "ярко-оранжевый", "морковный", "тыквенный", "мандариновый", 
        "orange", "bright orange", "tangerine", "carrot orange"],

    "жёлтый": [
        "жёлтый", "светло-жёлтый", "тёмно-жёлтый", "лимонный", "соломенный", "горчичный", "янтарный", "yellow", "bright yellow", 
        "lemon yellow", "mustard yellow", "amber", "золотистый", "золотой", "золото", "gold", 
        "golden", "gold-colored", "gold coloured", "champagne gold", "медный", "медь",  "copper", 
        "copper-colored", "copper coloured"],

    "зелёный": [
        "зелёный", "светло-зелёный", "тёмно-зелёный", "ярко-зелёный", "салатовый", "оливковый", "хаки", "мятный", 
        "изумрудный", "травяной", "болотный", "лаймовый", "оливково-зелёный", "green","khaki"],

    "голубой": [
        "голубой", "светло-голубой", "небесно-голубой", "лазурный", 
        "бирюзовый", "светло-бирюзовый", "тёмно-бирюзовый", "бирюза", "turquoise", "teal", "aqua"],

    "синий": [
        "синий", "светло-синий", "тёмно-синий", "ярко-синий", "васильковый", "кобальтовый", "индиго", "ультрамарин", 
        "blue", "navy",  "indigo", "ultramarine"],

    "фиолетовый": [
        "фиолетовый", "светло-фиолетовый", "тёмно-фиолетовый", "лиловый", "сиреневый", "лавандовый", "пурпурный", 
        "сливовый", "purple", "violet", "lilac", "lavender", "plum", "mauve"],

    "розовый": [
        "розовый", "светло-розовый", "тёмно-розовый", "ярко-розовый", "пудровый", "пастельно-розовый", "нежно-розовый", 
        "фуксия", "фуксиевый", 
        "малиновый", "pink",  "fuchsia", "magenta", ],

    "прозрачный": [
        "прозрачный", "полупрозрачный", "бесцветный", "clear", "transparent", "translucent", "colorless", "colourless"],
    
    "разноцветный": [
        "разноцветный", "многоцветный", "цветной", "пёстрый", "multicolor", "multicolour", "multi-color", "multi-colour", 
        "colorful", "colourful", "rainbow", "натуральный цвет", "натуральная расцветка", "натуральное дерево", "natural"],
    
    "чёрно-белый": ["чёрно-белый", "black and white", "black-white"],
}
